read_verilog /root/input/subleq.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /root/output/subleq_yosys
write_edif /root/output/subleq.edif
write_json /root/output/subleq.json
